{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.7/4.0"
      ],
      "degree": "Technical Diploma",
      "department": "Computer programming - Internet of Things",
      "duration": "2020-2022",
      "school_name": "Cambrian College"
    },
    {
      "awards_achievements": [
        "GPA: 8.40/10.0"
      ],
      "degree": "Bachelor of Technology",
      "department": "Information Technology",
      "duration": "2015-2019",
      "school_name": "R.K. University"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-viraniyagnik",
  "highlighted_projects": [
    {
      "description": "As a team member, I contributed to the development of a sophisticated hardware system that utilized a Raspberry Pi-4B as the control unit, programmed using Python. The system was designed to monitor for suspicious activity on-premises and featured advanced capabilities such as motion detection, temperature and humidity sensing for fire detection, and automatically sends the recorded video to the registered user and stores them on the cloud. Additionally, the system was designed to send real-time alerts to registered user in case of a fire detection within the monitored area.",
      "git_url": "https://github.com/viraniyagnik/Smart-surveillance-system",
      "name": "Smart Surveillance System (Capstone Project)"
    },
    {
      "description": "As a team leader, I successfully directed an interdisciplinary team from the computer/IT and pharmacy departments in the Image-based Crude Drug Identification project, resulting in the development of an efficient android mobile application utilizing advanced machine learning techniques powered by TensorFlow Hub, Python programming, and integration with external APIs. This application allows users to take a photo of a leaf or tree and select one from their device storage, then submit it to the application for analysis and identification of its potential for treatment of various diseases. Additionally, the application allows users to search for information on specific diseases, in both English and Gujarati language, and provides information on the herbal plant that beneficial for treatment.",
      "git_url": null,
      "name": "Crude Drug Identification -Interdisciplinary Project (Team Leader)"
    },
    {
      "description": "The website was developed with multiple functionalities, including product listing and categorization, user registration and login, shopping cart, order management, payment gateway integration, and data management utilizing technologies such as Java, JavaScript, and HTML/CSS. The Paytm API was integrated for secure credit/debit card transactions. The website was optimized for user experience and the MySQL database was configured for efficient data collection, categorization, and filtering.",
      "git_url": null,
      "name": "E-Commerce Website (Individual Project)"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a Cluster Monitor Agent that allows users to monitor and store hardware specifications and usage data for multiple Linux systems using bash scripts. The monitoring agent, when installed on each node, automatically collects hardware information and resource usage data from the server and persists it to the PostgreSQL database provisioned using Docker. Periodically, resource usage is obtained using Crontab, and then the collected data can be manipulated using SQL queries. Implemented Git for version control and used GitHub as the central repository, enabling effective code review and collaboration among team members.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
<<<<<<< HEAD
      "description": [
        "Grep App: The Java Grep app, implemented with core Java packages, stream API, and lambda functions, utilizes Maven for dependency management and JUnit4 for unit testing, while creating a docker image for deployment, allowing it to replicate the egrep Linux command with recursive option and write matched lines to a file.",
        "JDBC App: In this project, utilized Data Access Object and Repository patterns and the Core Java JDBC API with Maven-managed dependencies to perform CRUD operations on an existing dataset within a PostgreSQL database deployed on a Docker container, while testing the application using SLF4J logger and accessing the database from a terminal.",
        "Twitter App: The Core Java Twitter App, designed with model-view-controller architecture, utilizes Twitter RESTful API V2 and technologies like Maven, Apache HttpClient, OAuth signpost, and fasterXML Jackson Core for managing tweets through command line interface, and is integrated and unit tested with Mockito and JUnit4, and deployed in a Docker container with Twitter API OAuth keys as environment variables."
      ],
      "git_url": "/core_java",
      "name": "Core Java App"
=======
      "description": "This Java application was developed using IntelliJ IDEA IDE and Maven for building and managing dependencies. It uses Java.io, Stream API, and Lambda functions for file reading and writing. The application is built and packaged into a JAR file using Maven, with dependencies like SLF4J and JUnit4 also managed by Maven. It's deployed using a Docker container distributed on Docker Hub.",
      "git_url": "/core_java/grep",
      "name": "Java Grep App"
>>>>>>> 038ab18410c7b5d7442bbd5cbb9aa97e79d1861f
    }
  ],
  "name": "Yagnik Virani",
  "others": [
    {
      "bullets": [
        "Python Program (Infosys Campus Connect: 2017)",
        "Java Training (IIT Bombay: 2018)",
        "C Training (IIT Bombay: 2018)",
        "CCNA Routing and Switching @Cisco Networking Academy (2017-2018)"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Blind coding winner - MU Fest @Marwadi University (2018)"
      ],
      "title": "Awards"
    },
    {
      "bullets": [
        "I enjoy playing cricket, Participated in regional cricket tournaments",
        "Volunteer, HR conference @Confederation of Indian Industry (2017)"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Technologies Group Inc. ",
      "description": "At Jarvis, I am part of a cross-functional team, working collaboratively to design, develop, and implement software systems. With my strong skills in Python and Java, I am responsible for writing high-quality, efficient, and scalable code. I use cutting-edge technologies such as Docker, Linux/Bash, Git, and GitHub to manage the software development process and ensure code reliability. I am dedicated to delivering software features that meet the requirements, and I am always up to date with the latest industry trends and best practices. Additionally, I actively participate in Agile development processes, using the Scrum methodology to meet project deadlines and deliver high-quality software solutions.",
      "duration": "2023-present",
      "title": "Software and Data Engineer"
    },
    {
      "company": "Microcreative Website Design \u0026 Development",
      "description": "As a developer, I was involved in high-impact Python projects for Nexus and had a hands-on role in programming tasks. I utilized the Django web framework to develop both frontend and backend modules, wrote test cases, and regularly conducted testing with my team on a weekly basis. I was responsible for maintaining large databases and configuring services to reduce cost. I played an instrumental role in developing, designing, and deploying the code for continuous integration and continuous delivery (CI/CD) to streamline the software development process and improve the efficiency and reliability of code releases. ",
      "duration": "2019-2020",
      "title": "Web Developer"
    },
    {
      "company": "Nexa Infotech IT Services Pvt. Ltd",
      "description": "As a skilled Python Intern, I was responsible for creating clear, maintainable, and efficient code. I collaborated with other team members and stakeholders to plan, create, and implement new features, and was actively involved in the design and development of new software systems and applications. I also played a crucial role in code reviews, ensuring that the code followed the company's standards and guidelines, and remained current with the latest developments and technologies.",
      "duration": "2019",
      "title": "Python Developer Intern"
    }
  ],
  "skills": {
    "competent": [
      "Docker",
      "REST APIs",
      "C#",
      "AWS/Azure/GCP",
      "Django",
      "JavaScript",
      "HTML/CSS"
    ],
    "familiar": [
      "C/C++",
      "Kubernetes",
      "Jenkins",
      "Spring Boot",
      "Node.js",
      "Angular/React"
    ],
    "proficient": [
      "Java",
      "Python",
      "Networking",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git/GitHub"
    ]
  },
  "summary": "I have earned both a Technical Diploma in Computer Programming - Internet of Things from Cambrian College and a Bachelor of Technology degree in Information Technology from R.K. University. I am currently working as a software and data engineer at Jarvis Technologies Group Inc., utilizing my expertise to develop efficient and effective software systems. During my technical diploma program, I served as a peer tutor and provided individual or small group tutoring to students. Additionally, as a member of the Program Advisor Committee (PAC) at Cambrian College, I represented the student body and contributed to the development of courses. I find great pleasure in tackling technical challenges, exploring new technologies, and developing software for various platforms. I love exploring complex concepts as I have a strong interest in mathematics and a passion for working with numbers. I enjoy interacting with people and collaborating with them in a team environment. I am capable of rapidly acquiring new knowledge and have a eagerness to learn, always striving to expand my understanding and skillset. I am excited for the challenges and rewards that come with being part of a successful software development team."
}
